rails/EduWords/app/views/tags/index.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1
---
        <% if current_member.role == 'admin' %>
        <td><%= Member.find(tag.member_id).username %></td>