rails/EduWords/app/views/tags/show.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1
---
  		<strong>Member:</strong>
  		<%= Member.find(@tag.member_id).username %>