rails/EduWords/app/views/languages/show.html.erb

  		<strong>Member:</strong>
  		<%= Member.find(@language.member_id).username %>
---
SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1