rails/EduWords/app/views/tests/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "tags_tests" ON "tags"."id" = "tags_tests"."tag_id" WHERE "tags_tests"."test_id" = ?  [["test_id", 1]]
---
				<td><%= test.result %></td>
				<td><% test.tags.each do |tag| %>

SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1
---
				<% if current_member.role == 'admin' %>
				<td><%= Member.find(test.member_id).username %></td>