rails/EduWords/app/views/words/index.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = 11 ORDER BY "members"."id" ASC LIMIT 1
---
            <% if current_member.role == 'admin' %>
              <td><%= Member.find(word.member_id).username %></td>