rails/EduWords/app/views/words/show.html.erb

		<div class="col-md-3 userdata">
			<%= Member.find(@word.member_id).username %>
---
SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1

		<div class="col-md-3 userdata">
			<%= Language.find(@word.language1_id).name %>
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", 1]]

		<div class="col-md-3 userdata">
			<% @word.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tags_words" ON "tags"."id" = "tags_words"."tag_id" WHERE "tags_words"."word_id" = ?  [["word_id", 2]]