rails/EduWords/app/views/devise/registrations/edit.html.erb

			<% if current_member.role == 'admin' %>
			<% @members = Member.all %>
---
SELECT "members".* FROM "members"