rails/EduWords/app/controllers/languages_controller.rb

  def index
    if  member_signed_in?
      if current_member.role == 'admin'
        @languages = Language.all
---
SELECT "languages".* FROM "languages" WHERE (member_id = 2)

  def create
    if  member_signed_in?
      @language = Language.new(language_params)
      @language.member_id = current_member.id
      @language.save
---
INSERT INTO "languages" ("created_at", "member_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 29 Nov 2014 17:58:30 UTC +00:00], ["member_id", 8], ["name", "sadsdasd"], ["updated_at", Sat, 29 Nov 2014 17:58:30 UTC +00:00]]

  def destroy
    if  member_signed_in?
      @language.destroy
---
DELETE FROM "languages" WHERE "languages"."id" = ?  [["id", 5]]

  def set_language
    @language = Language.find(params[:id])
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", "5"]]