rails/EduWords/app/controllers/tags_controller.rb

  def index
    if  member_signed_in?
      if current_member.role == 'admin'
       @tags = Tag.all
---
SELECT "tags".* FROM "tags" WHERE (member_id = 2)

  def create
    @tag = Tag.new(tag_params)
    @tag.member_id = current_member.id
    @tag.save
---
INSERT INTO "tags" ("created_at", "language_member_id", "member_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 29 Nov 2014 17:46:56 UTC +00:00], ["language_member_id", 1], ["member_id", 8], ["name", "testowy"], ["updated_at", Sat, 29 Nov 2014 17:46:56 UTC +00:00]]

  def destroy
    @tag.destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]

    def set_tag
      @tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]