rails/EduWords/app/controllers/tests_controller.rb

SELECT "tests".* FROM "tests" WHERE (member_id = 11)
---
  def index
    if  member_signed_in?
      if current_member.role == 'admin'
        @tests = Test.all

INSERT INTO "tests" ("created_at", "date", "member_id", "result", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 03 Nov 2014 15:02:46 UTC +00:00], ["date", "13/13/2013"], ["member_id", 8], ["result", 251], ["updated_at", Mon, 03 Nov 2014 15:02:46 UTC +00:00]]
---
  def create
    @test = Test.new(test_params)
    if  member_signed_in?
      @test.member_id = current_member.id
    end
    if @test.member_id != nil
     @test.save

DELETE FROM "tags_tests" WHERE "tags_tests"."test_id" = 1
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 1]]
---
  def destroy
    @test.destroy

SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_test
    @test = Test.find(params[:id])