rails/EduWords/app/controllers/words_controller.rb

  def index
    if  member_signed_in?
      if current_member.role == 'admin'
        @words = Word.all
---
SELECT "words".* FROM "words" WHERE (member_id = 11)

  def new
    if  member_signed_in?
      @word = Word.new
      @all_tags = Tag.all
      @all_languages = Language.all
---
SELECT "tags".* FROM "tags"
SELECT "languages".* FROM "languages"

  def edit
    if  member_signed_in?
      @all_tags = Tag.all
      @all_languages = Language.all
---
SELECT "tags".* FROM "tags"
SELECT "languages".* FROM "languages"

  def create
    if  member_signed_in?
      @word = Word.new(word_params)
      @word.member_id = current_member.id
      @word.save
---
INSERT INTO "tags_words" ("word_id", "tag_id") VALUES (5, 1)
INSERT INTO "words" ("created_at", "language1_id", "language2_id", "member_id", "namelanguage1", "namelanguage2", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    if  member_signed_in?
      @word.destroy
---
DELETE FROM "tags_words" WHERE "tags_words"."word_id" = 3
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 3]]

  def download
    if  member_signed_in?
      @words = Word.find(:all, :conditions => ['member_id = ?', current_member.id])
      wordsy = ""
      i = 0;

      @words.each do |word|
        i = i + 1
        wordsy += i.to_s + "." + " " + word.namelanguage1 + " " + word.namelanguage2 + " " + Language.find(word.language1_id).name + " " + Language.find(word.language2_id).name + "\n"
---
SELECT "words".* FROM "words" WHERE (member_id = 1)
SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", 4]]

  def set_word
    @word = Word.find(params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "6"]]