rails/EduWords/app/controllers/words_controller.rb

  def index
    if  member_signed_in?
      if current_member.role == 'admin'
        @words = Word.all
      else
        @words = Word.find(:all, :conditions => ['member_id = ?', current_member.id])
      end
      respond_with(@tests)
    elsif params[:u] != ""
      @member = Member.find(:all, :conditions => ['email = ?', params[:u]]).first
---
SELECT "members".* FROM "members" WHERE "members"."id" = 8 ORDER BY "members"."id" ASC LIMIT 1