rails/EduWords/app/views/home/dashboard.html.erb

SELECT COUNT(*) FROM "words"
SELECT COUNT(*) FROM "languages"
SELECT COUNT(*) FROM "tags"
SELECT COUNT(*) FROM "tests"
SELECT "members".* FROM "members"
SELECT COUNT(*) FROM "members"
---
			<tr>
				<td><%= Word.count %></td>
				<td><%= Language.count %></td>
				<td><%= Tag.count %></td>
				<td><%= Test.count %></td>
				<td><%= Member.count %></td>